---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.BendFailures.DeleteMiddleBendNotAllowed
source: html/5e38e54d-34e4-5f61-1dd3-69ffd56b8e6c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.BendFailures.DeleteMiddleBendNotAllowed Property

Delete a middle bend in a bank is not allowed

## Syntax (C#)
```csharp
public static FailureDefinitionId DeleteMiddleBendNotAllowed { get; }
```